src/Enums/ОсобенностиУчетаНоменклатуры/ОсобенностиУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОсобенностиУчетаНоменклатуры</name>
  <enumValues>
    <name>БезОсобенностейУчета</name>
  </enumValues>
  <enumValues>
    <name>АлкогольнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>СодержитДрагоценныеМатериалы</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияИзНатуральногоМеха</name>
  </enumValues>
  <enumValues>
    <name>КиЗГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ОрганизациейПродавцом</name>
  </enumValues>
  <enumValues>
    <name>ОрганизациейПоАгентскойСхеме</name>
  </enumValues>
  <enumValues>
    <name>Партнером</name>
  </enumValues>
  <enumValues>
    <name>ТабачнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ОбувнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Антисептики</name>
  </enumValues>
  <enumValues>
    <name>БАДы</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
  <enumValues>
    <name>СоковаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>БезалкогольноеПиво</name>
  </enumValues>
  <enumValues>
    <name>Зерно</name>
  </enumValues>
  <enumValues>
    <name>ПродуктыПереработкиЗерна</name>
  </enumValues>
  <enumValues>
    <name>МорепродуктыПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПодконтрольнаяПродукцияСАТУРН</name>
  </enumValues>
  <enumValues>
    <name>ЗерноВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПродуктыПереработкиЗернаВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МясоПодконтрольноеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ВетеринарныеПрепараты</name>
  </enumValues>
  <enumValues>
    <name>ИгрыИИгрушкиДляДетей</name>
  </enumValues>
  <enumValues>
    <name>РадиоэлектроннаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ТитановаяМеталлопродукция</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>РастительныеМасла</name>
  </enumValues>
  <enumValues>
    <name>ОптоволокноИОптоволоконнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПечатнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>СтроительныеМатериалы</name>
  </enumValues>
  <enumValues>
    <name>ОтопительныеПриборы</name>
  </enumValues>
  <enumValues>
    <name>Бакалея</name>
  </enumValues>
  <enumValues>
    <name>АлкогольнаяПродукцияДо9Процентов</name>
  </enumValues>
  <enumValues>
    <name>ТелефоныИНоутбуки</name>
  </enumValues>
  <enumValues>
    <name>ПиротехническиеИзделияИСредстваПожарнойБезопасности</name>
  </enumValues>
  <enumValues>
    <name>КабельнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>МоторныеМасла</name>
  </enumValues>
  <enumValues>
    <name>БезалкогольныеНапитки</name>
  </enumValues>
  <enumValues>
    <name>ПивоВПотребительскихУпаковках</name>
  </enumValues>
  <enumValues>
    <name>ТехническиеСредстваРеабилитации</name>
  </enumValues>
  <enumValues>
    <name>МедицинскиеИзделия</name>
  </enumValues>
  <enumValues>
    <name>МедицинскиеИзделия20</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность2025</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхВлажныеБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПолимерныеТрубы</name>
  </enumValues>
  <enumValues>
    <name>СладостиИКондитерскиеИзделия</name>
  </enumValues>
  <enumValues>
    <name>ПечатныеПлаты</name>
  </enumValues>
  <enumValues>
    <name>ДезинфицирующиеСредства</name>
  </enumValues>
  <enumValues>
    <name>БАДы2025</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ОсобенностиУчетаНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает текст подсказки по особенностям учета номенклатуры.
//
// Параметры:
//	ОсобенностьУчета - ПеречислениеСсылка.ОсобенностиУчетаНоменклатуры	 - особенность учета номенклатуры.
//
// Возвращаемое значение:
//	Строка - подсказка по особенности учета номенклатуры.
//
Функция ПодсказкаПоОсобенностиУчетаНоменклатуры(ОсобенностьУчета) Экспорт
	
	ТекстПодсказки = "";
	
	Если ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ОрганизациейПродавцом Тогда
		ТекстПодсказки = НСтр("ru = 'Услуга выполняется собственной организацией, продается ей же.';
								|en = 'Service is provided by own company, the service is sold by it.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ОрганизациейПоАгентскойСхеме Тогда
		ТекстПодсказки = НСтр("ru = 'Услуга выполняется собственной организацией (принципалом), продается по агентскому договору.';
								|en = 'Service is provided by own company (principal), the service is sold under an agency agreement.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.Партнером Тогда
		ТекстПодсказки = НСтр("ru = 'Услуга выполняется сторонним исполнителем (принципалом), продается по агентскому договору.';
								|en = 'Service is provided by an external assignee (principal), the service is sold under an agency agreement.'");
	КонецЕсли;
	
	НоменклатураЛокализация.ПодсказкаПоОсобенностиУчетаНоменклатуры(ТекстПодсказки, ОсобенностьУчета);
	
	Возврат ТекстПодсказки;
	
КонецФункции

// Связь особенностей учета и функциональных опций. Если связь не указана, то особенность учета по умолчанию скрывается.
//
// Возвращаемое значение:
//	Соответствие
//	 * Ключ - ПеречислениеСсылка.ОсобенностиУчетаНоменклатуры.
//	 * Значение - Строка - имена функциональных опций через запятую, значения опций объединяются по И.
//
Функция СвязьОсобенностейУчетаИФО() Экспорт
	
	СвязьОсобенностейУчетаИФО = Новый Соответствие;
	
	СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.ОрганизациейПродавцом, "ИспользоватьПродажуАгентскихУслуг");
	СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.ОрганизациейПоАгентскойСхеме, "ИспользоватьПродажуАгентскихУслуг,ИспользоватьНесколькоОрганизаций");
	СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.Партнером, "ИспользоватьПродажуАгентскихУслуг");
	
	НоменклатураЛокализация.СвязьОсобенностейУчетаИФО(СвязьОсобенностейУчетаИФО);
	
	Возврат СвязьОсобенностейУчетаИФО;
	
КонецФункции

// Возвращает Истину если включены ФО особенностей учета номенклатуры
/// 
// Возвращаемое значение:
//   Булево - возвращает Истину ФО включены.
//
Функция ОднаИзОсобенностейВключена() Экспорт
	
	ОднаИзОсобенностейВключена = Ложь;
	
	СвязьОсобенностейУчетаИФО = СвязьОсобенностейУчетаИФО();
		
	Для Каждого ЗначениеПеречисления Из Перечисления.ОсобенностиУчетаНоменклатуры Цикл
		
		Если ЗначениеПеречисления = Перечисления.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета Тогда
			Продолжить;
		КонецЕсли;
		
		ОсобенностьВключена = Истина;
		ИменаФО = СвязьОсобенностейУчетаИФО.Получить(ЗначениеПеречисления);
		
		Если ИменаФО <> Неопределено Тогда
			МассивИменФО = СтрРазделить(ИменаФО, ",");
			Для Каждого СтрМас Из МассивИменФО Цикл
				Если Не ПолучитьФункциональнуюОпцию(СтрМас) Тогда
					ОсобенностьВключена = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ОсобенностьВключена Тогда
			ОднаИзОсобенностейВключена = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОднаИзОсобенностейВключена;
	
КонецФункции

#КонецОбласти

#КонецЕсли
